[
    {
        "id": 0.299432857526,
        "content": "Just to kick us off Paddy, an issue we have already started discussing is the difficulty of engaging people (staff, students, others) who are not already interested in these issues. I wonder have you any initial thoughts on that? "
    },
    {
        "id": 0.299432857526,
        "content": "Yes @alexanderomahony I completely agree - but this is complex, time consuming and costly. It also demands patience and flexibility and a commitment to challenging dominant ideas about what we ■■■■■, why we assess it and how we assess it. This is not easy - witness the controversy surrounding any effort to reconceptualise assessment at second level. "
    },
    {
        "id": 0.299432857526,
        "content": "Diversity remains a challenge with few men or people from disadvantaged backgrounds entering the profession "
    },
    {
        "id": 0.299432857526,
        "content": "I agree with this and without that understanding it's hard to galvanise support for additional resources but not impossible. The Pareto 80/20 rule applies, once large corporations are on side you have the momentum "
    },
    {
        "id": 0.299432857526,
        "content": "As the saying goes: not everything that matters can be measured, and not everything that is measured matters "
    },
    {
        "id": 0.299432857526,
        "content": "Actually the Brexit vote and Trump's election have both convinced me that the fault lines in societies have emerged because many people talk only to those who think like themselves. To me, the benefit of international experience for our students is in challenging their (and our) comfortable assumptions about so many things from systems of politics, to received truths, to variations in acceptable behaviours. "
    },
    {
        "id": 0.299432857526,
        "content": "yes, that's always my worry about the 5 o clock lectures, I would think that they can be hard going after a demanding practical session. Do you think it would matter if the 5 o clock session was a lecture or a tutorial? Would you be more likely to attend one over the other? "
    },
    {
        "id": 0.294214972163,
        "content": "Insufficient command of their source languages, or evidence of research.I saw this with both BA and MA translation candidates. "
    },
    {
        "id": 0.294214972163,
        "content": "The same issue is raised regarding the Sports Centre. "
    },
    {
        "id": 0.294214972163,
        "content": "I am, I'm currently in the BBS programme so I have very little interaction with the Irish language and am not often on SPC or All Hallows, which I feel is where the majority of Irish speakers are. "
    },
    {
        "id": 0.294214972163,
        "content": "New private school set to be the  State’s most expensive "
    },
    {
        "id": 0.294214972163,
        "content": "I am not sure what we can do to make the timetable support learning better, but something must be done to resolve the current issues, especially for HSS. The current situation is that the timetable dictates the curriculum, constrains new initiatives, adds stress to staff and students having to commute between three campuses (not to mention administrative staff doing our timetables under considerable pressure and performing miracles nonetheless). "
    },
    {
        "id": 0.294214972163,
        "content": "adding technology to a bad process just allows you to make your mistakes more quickly "
    },
    {
        "id": 0.294214972163,
        "content": "Yes Eithne but the issue we are seeing from emerging research from the DARE scheme is that there seems to be a significant under reporting of disabilities in DEIS schools. The challenge is how do we support these schools being ambitious for students in this category "
    },
    {
        "id": 0.294214972163,
        "content": "I completely agree with @Yamna_Ali_Alsheri. I am a DCUBS student and I have to say having a tutorial once every second week isn't enough. I would personal like to have some mock exams that would not have an implication on our grades but to help us understand what is wanted of us. The volunteering would be a great way to earn credits. I also think that for exams it would make more sense to have them before breaks. This is due to the information still being fresh in our minds and it would allow students to actually have a break, instead of spending most of the studying and worrying about exams "
    },
    {
        "id": 0.294214972163,
        "content": "One practical thing that would make an enormous difference to both the educational outcome and the stress is this - give us all of the assignments on day 1, so we can manage our time. "
    },
    {
        "id": 0.294214972163,
        "content": "You have to introduce the concept that DCU is something that stays with graduates for life, not somewhere you study for a few years. "
    },
    {
        "id": 0.294214972163,
        "content": "You've framed it exactly and feeds into @Sean_O_Duill point and @Richard_Stokes comment re: knowledge drain "
    },
    {
        "id": 0.294214972163,
        "content": "I  was always a believer that  students should get involved with the issues that involve them directly in college "
    },
    {
        "id": 0.294214972163,
        "content": "Ar dtús báire, iontach sásta bheith anseo leis an ábhar seo a phlé libh. Is maith go bhfuil an deis seo againn ár gcuid tuairimí is smaointí a chur le chéile agus maitheas a dhéanamh don Ghaeilge san ollscoil "
    },
    {
        "id": 0.294214972163,
        "content": "In terms of the mythical 'Paperless Office', what can we be doing to cut down on the amount of printing that is carried out on campus?  According to our managed print solution, this was environmental impact since May 14 2010 (of what we have measured - the real figure would be higher) : 175.4 trees 63,547 kg of CO2 4,001,129 hours running a 60W bulb "
    },
    {
        "id": 0.294214972163,
        "content": "As we say to prospective students at Open Education..it's never too late!! "
    },
    {
        "id": 0.294214972163,
        "content": "I am, I'm currently in the BBS programme so I have very little interaction with the Irish language and am not often on SPC or All Hallows, which I feel is where the majority of Irish speakers are "
    },
    {
        "id": 0.294214972163,
        "content": "And, to add to that, also factor in the issues arising from the new multi-campus environment and the fact that many people are just now bedding down in new offices/systems? "
    },
    {
        "id": 0.289050497375,
        "content": "I completely agree with you there Eithne, some of the criteria really needs to be reexamined. I couldn't get dare but if I had not have gotten access I wouldn't be in third level. But unlike me there are hundreds of students who missed that window and are now turning their backs on the system and failing to reapply. "
    },
    {
        "id": 0.289050497375,
        "content": "yes, we can incorporate it in the curricula as a way to a)monitor 2) enforce it. It could be interesting to see how international business issues can be discuss "
    },
    {
        "id": 0.289050497375,
        "content": "The question always arises: what do we eliminate to make room for the new modules and the fear is always that you will dilute the core content too much. "
    },
    {
        "id": 0.289050497375,
        "content": "Yes, but this may not be enough... Look at the rise of populism and the far-right in France. Everyday, experts and the media decrypt false information, fake news, etc. Does it change anything? Hardly... "
    },
    {
        "id": 0.289050497375,
        "content": "I think that universal design should be a key value in all developments.  Developments to date might appear to have ignored this.  And it's not just within buildings but between buildings. "
    },
    {
        "id": 0.289050497375,
        "content": "sorry in advance Ana, this is a silly question, but can people submit items for consideration for the DCU research newsletter? I just assumed that your office decided what should go in there, and it never dawned on me that I could offer content.... "
    },
    {
        "id": 0.289050497375,
        "content": "vi)\tcontribute to international development and the resolution of global problems "
    },
    {
        "id": 0.283940206184,
        "content": "hi Deirdre, do you have any thoughts about the questions you've posed? I fully agree that development of attributes within programmes is critical "
    },
    {
        "id": 0.283940206184,
        "content": "Yes Brian , agree , as  I said at the outset - get involved in whats in front of you , what engages you , what you enjoy - reach out to others , do not be demoralised if only one other student wants to assist . Whe inTrinity if we called a meeting and very few turned up - do not get demoralised , 100 students could have 100 different reasons for not coming- start with that you have, where you are. . One step , long walk etc "
    },
    {
        "id": 0.283940206184,
        "content": "When you look around the university the potential resources are already there.  We have students who are accountants and coders, designers and engineers, scientists and marketing to name just some.  The main problem for someone with an idea is they do not have all the skills it requires to take it to the market themselves.  How much time is wasted trying to learn a discipline from first principles when there is a full building of people with those skills next door! "
    },
    {
        "id": 0.283940206184,
        "content": "Can you please elaborate in this first issue for us... "
    },
    {
        "id": 0.283940206184,
        "content": "Yes, but I think universities also have some responsibility to change, it is not always about changing others. We can make the language understandable, the culture welcoming, without sacrificing quality. "
    },
    {
        "id": 0.283940206184,
        "content": "Totally agree, there is a place for numbers but we also should not limit ourselves by them... "
    },
    {
        "id": 0.278884821977,
        "content": "Forgive my ignorance in advance but something @paddy_woodworth said about a Daisy (and the writhing rhododendron's choking the park) makes me ask if we have a native species policy for planting on the campuses? Invasive species are a pet hate and Ireland is well behind countries like New Zealand and so on - I can walk into a garden centre and buy killer varieties of plant that that take over native Irish habitats rapidly. Let's celebrate our native flora and fauna in DCU. "
    },
    {
        "id": 0.278884821977,
        "content": "Interestingly - No one single unit understood the process end to end. they all knew there own pieces! "
    },
    {
        "id": 0.278884821977,
        "content": "How much support  was offered by DCU and the Society of Chartered Accountants? How do you feel it compared to the amount of support middle class students got in terms of grinds and grind schools? "
    },
    {
        "id": 0.278884821977,
        "content": "It's a difficult one. But we have to tackle it. That means incentives at all levels for those learning languages, no matter how marginal the results might seem to be. "
    },
    {
        "id": 0.273885018739,
        "content": "Thanks Warren ..Apologies if there have been issues which are outstanding for some time.There is a central email address you can use to log any of these type of issues: classrooms.service@dcu.ie "
    },
    {
        "id": 0.273885018739,
        "content": "Migrants including asylum seekers and refugees (not the right terminology) are extremely important and would have multiplier effect, too. I know that some members of the Roma group are eager to study and many of them who are currently doing so hid their backgrounds to avoid unnecessary attention. "
    },
    {
        "id": 0.273885018739,
        "content": "In my experience it doesn't help in DCU that when the student body has in the past attempted to be politically or socially engaged beyond DCU's traditional 'engagement' programs - such as DCU in the Community or the wonderful program (which I participated in) , if I recall the Age Friendly initiative - student leaders or activists were actively discouraged not be having debates on reproductive rights and other major issues that have both in the past and are currently significant issues. "
    },
    {
        "id": 0.273885018739,
        "content": "Ana we definitely don't measure innovation by invoices for research or licences...for DCU tit's about solving problems articulated by society or by prospective partners but its not limited to science or technology. "
    },
    {
        "id": 0.26894142137,
        "content": "More colour needed. More art. More of the unexpected! "
    },
    {
        "id": 0.26894142137,
        "content": "Is maith na hUltaigh go cinnte agus is léir go bhfuil neart mic léinn ó fud fad na tíre atá sásta cabhrú ach is dócha gur fiú bheith ag smaoineamh leis go gcabhródh tuilleadh acmhainní! "
    },
    {
        "id": 0.26894142137,
        "content": "Sin an fáth go bhfuilim ag baint páirteach as an gcómhrá seo...chun níos mó oibre a thabhairt do @Siobhan_Seoighe "
    },
    {
        "id": 0.26894142137,
        "content": "D'fhéadhfaidh sé sin a bheith spéisiúil Barra cinnte cén fáth nach mbeadh a leithéad ann, cinnte. Creidim ba chóir go mbeadh an Ghaeilge lárnach ar gach campas, tá aithne agam ar neart daoine go bhfuil Gaeilge acu agus sásta í a labhairt leat! "
    },
    {
        "id": 0.26894142137,
        "content": "Smaoineamh iontach. Níor mhiste ach an oiread roinnt cainteanna a shocrú do phobal na hOllscoile trí mheán an Bhéárla... eolas a thabhairt dóibh mar gheall ar an teanga srl srrl. "
    },
    {
        "id": 0.26894142137,
        "content": "Slack for students? "
    },
    {
        "id": 0.26894142137,
        "content": "7:18 AM - 25 Mar 2017 "
    },
    {
        "id": 0.26894142137,
        "content": "Sílim gur smaoineamh den scoth é seo. Bhí/tá an t-ádh orainn go bhfuil/go raibh muid ag foghlaim ó léachtóirí atá tar éis oiread taighde dochreidte a dhéanamh. Tá obair mhór ar siúl ag lucht Fiontar agus ní bhíonn a fhios ag fiú mic léinn na scoile go bhfuil a dhath ag dul ar aghaidh. Tábhachtach go mbeadh aitheantas tugtha don obair sin agus go gcuirfear i lár an aonaigh é. "
    },
    {
        "id": 0.26894142137,
        "content": "La voilà ! Tá cuma ghalánta ar an tseomra na laethe seo agus déanann sin difir mhór ó thaobh fonn a chur ar dhaoine theacht agus Gaeilge a labhairt in áit neamhfhoirmeálta compórdach "
    },
    {
        "id": 0.26894142137,
        "content": "Tagaim leat Aisling agus tá an moladh céanna ag straitéis an Rialtais...an féidir linn an deis sin a thapú?? "
    },
    {
        "id": 0.26894142137,
        "content": "Tá sé go hiontach gur chabhraigh an cúrsa trí Ghaeilge chomh mór sin leat agus go dteastaíonn uait teagasc i scoil lán-Ghaeilge. "
    },
    {
        "id": 0.26894142137,
        "content": "Donal ConwayFAI Vice PresidentChair of the FAI Development Committee "
    },
    {
        "id": 0.26894142137,
        "content": "Sin rud inteacht a mbeadh suim agamsa ann "
    },
    {
        "id": 0.26894142137,
        "content": "As discussed earlier, an email from a concerned student. "
    },
    {
        "id": 0.26894142137,
        "content": "I would also add \"critical\" to the list of adjectives. "
    },
    {
        "id": 0.26894142137,
        "content": "Sliotán oscailte rialta a bhí sa cheann agam - amanna ag a bhféadfadh mic léinn bualadh isteach idir léachtaí agus comhrá a dhéanamh as Gaeilge. Bhí an nós sin láidir sular deineadh an seomra a athchóiriú agus ba mhaith an rud é an deis a chur ar fáil do mhic léinn arís - fiú muna mbeadh ann ach tréimhse amháin in aghaidh an lae. Má bhíonn cúnamh ag teastáil ón bhfoireann, bheinn lánsásta a bheith páirteach! "
    },
    {
        "id": 0.26894142137,
        "content": "“The walk to the library is the most painful thing ever” "
    },
    {
        "id": 0.26894142137,
        "content": "You haven't said anything inappropriate. What was flagged? "
    },
    {
        "id": 0.26894142137,
        "content": "“The walk to the library is the most painful thing ever” "
    },
    {
        "id": 0.26894142137,
        "content": "What of AI in education? Is the hype justfied? (And can you tell if I am a bot?) "
    },
    {
        "id": 0.26894142137,
        "content": "B'fhéidir iad a fhoscailt don phobal fosta? Ag dul siar ar a dúradh ar ball - DCU mar lárionad Gaeilge ag cruthú deiseanna labhartha do mhuintir na cathrach ina iomláinne? "
    },
    {
        "id": 0.26894142137,
        "content": "Exactly, preparing for success is the best way forward. Education is a journey and unfortunately not everyone has a ticket for that journey. There needs to be different journeys not just he, fe or solas. "
    },
    {
        "id": 0.26894142137,
        "content": "What of AI in education? Is the hype justfied? "
    },
    {
        "id": 0.26894142137,
        "content": "A chairde - go raibh maith agaibh - Tá sé sin go hiontach! "
    },
    {
        "id": 0.26894142137,
        "content": "Is trua liom é sin a chloisteáil:cry: Tá bia ar fáil anseo i Leabharlann Uí Chríogáin, Campas Phádraig. "
    },
    {
        "id": 0.26894142137,
        "content": "Tanks Emma, should I speak Irish to go there? "
    },
    {
        "id": 0.26894142137,
        "content": "Maith thú, a Phádraig. Agus is iontach an rud é go bhfuil an oiread sin daoine  ag caint air seo. "
    },
    {
        "id": 0.26894142137,
        "content": "Sin smaoineamh maith - lárionad Gaeilge i dtuaisceart Bhaile Átha Cliath. Seans eile don Ollscoile ceangail a fhorbairt leis an pobal. "
    },
    {
        "id": 0.26894142137,
        "content": "Exactly - the ultimate \"Complex System\" to design "
    },
    {
        "id": 0.26894142137,
        "content": "I think that their should be events run by the su most evenings that don't involved alcohol because I know from some of my friends that they don't attend events such as ■■■■■ night etc because it's always messy. Maybe it's something to look into. Also a lot more events during the day like freshers week events would be great. Especially down in st pats, coming from glasnevin I still cannot adapt to pats and there is nothing to do down here when you're on a break as everything happens in glasnevin. "
    },
    {
        "id": 0.26894142137,
        "content": "Maybe one way of doing this could be to link up other incoming first years? Coming from the same area, starting the same course? It can be really daunting coming in as a first year especially if you don't know anyone else. "
    },
    {
        "id": 0.26894142137,
        "content": "1:46 AM - 30 Mar 2017 "
    },
    {
        "id": 0.26894142137,
        "content": "This section form the Examiner highlights the issue. "
    },
    {
        "id": 0.26894142137,
        "content": "Déanaim féin sin a Dheirdre, ach tá fhios agam go raibh smaointiú ag @Siobhan_Seoighe ceann deas deartha ag an ollscoil a dhéanamh agus bheadh cuma oifigiúil air "
    },
    {
        "id": 0.26894142137,
        "content": "Will the new student centre have space for students to work collaboratively as these types of spaces are lacking in the university and with more and more assignments requiring collaboration it is something the university is lacking "
    },
    {
        "id": 0.264054606073,
        "content": "Hi my name is Rawan. I think that the more the challenges and  ‏obstacles The more we learn .but sometimes the global difficulties can affect how we  learn . "
    },
    {
        "id": 0.264054606073,
        "content": "So it's not the problem of just DCU or Irish institutions is my point "
    },
    {
        "id": 0.264054606073,
        "content": "One way that DCU increases impact is to focus on how our research not only responds to societal issues or problems, but includes various people from outside the university in the research itself. That includes citizen science projects, where the public are asked to contribute to collecting data etc,  but in our Research and Enterprise Hubs, we also review funding proposals put together by our academics, seeing where it is possible to bring in NGOs, and the wider public, in research design. "
    },
    {
        "id": 0.264054606073,
        "content": "Everyone on DCU Fuse, and at our hub here on the DCU St Patrick's campus, has been hugely impressed by your answers.Thank you for that.We will continue the conversations at another time.Colleagues, we unfortunately have to let David go now. "
    },
    {
        "id": 0.264054606073,
        "content": "Never hurts! "
    },
    {
        "id": 0.264054606073,
        "content": "Having a bin beside you will just give you the temptation to just mix everything!You have been sitting in front of your desk for how many hours? Is it not a good idea to give yourself a break for 1 minute and throw your bin to the right place? "
    },
    {
        "id": 0.254453385874,
        "content": "However, this is not the case for graduate students, either local or international as the current SU fails to engage this communities, probably as the activities offered do not suit the needs of postgraduates. "
    },
    {
        "id": 0.249739894405,
        "content": "Its a slow change, its not like flicking a switch. "
    },
    {
        "id": 0.249739894405,
        "content": "Hi Audrey, we're looking to address this in the Business School.  Currently, we have one postgraduate programme (MECB) which provides students with the option to addend a recognised summer school and complete a supporting reflective piece on the value of an international experience.  So far this year we have 9 students registered for that option.  In addition, at undergraduate level we have embedded a summer school module into a number of programmes in final year. The idea is that students will attend a recognised summer school (we provide a list) and then bring us back evidence of completion.  We then exempt them from ten credits in final year.  Not only does this provide that all important international experience but it also lightens the workload in final year. "
    },
    {
        "id": 0.249739894405,
        "content": "Having recently attended the women in leadership talk given by Dr Michelle Williams of Harvard university, I was struck by her comment that if we want to encourage diversity in our student population then we must have diversity among our staff as students need a mirror where they see themselves reflected.  We are addressing gender balance but people of colour are not so evident among our staff "
    },
    {
        "id": 0.249739894405,
        "content": "One of the main concerns is to make sure it's affordable for students too - a lot of the new accommodation being built, like the complex on Dorset Street looks to be quite expensive "
    },
    {
        "id": 0.249739894405,
        "content": "It's significant, Graham, how often the 'communications deficit' from academia into the political system has come up in DCU-Fuse conversations in the past 24 h.One of our earlier VIP contributors (Steve Maharey) is a former NZ Education Minister and a former University Vice Chancellor -- he highlighted the communications problem v strongly.This is both institutional and sectoral.Needs our collective attention. "
    },
    {
        "id": 0.249739894405,
        "content": "I've had similar ethical dilemmas even when working on my final year project. As a biology student, we generate an abhorrent amount of plastic waste which cannot be recycled due to the contamination of the material. I've attempted to be as resource conscious as possible and minimize this impact, but it still feels difficult to work in a biological research field and be environmentally conscious too! "
    },
    {
        "id": 0.245085013132,
        "content": "Being previous chair of Walk and Talk, the two societies defiantly help with the over load of people awaiting appointments who feel alone. "
    },
    {
        "id": 0.245085013132,
        "content": "The University of Strathclyde in conjunction with the university of Glasgow run some type of foundation course for ITE - their course is not a pre-entry course (as may be run in nursing) but does focus on some modules that are covered In the first year of the degree course "
    },
    {
        "id": 0.245085013132,
        "content": "Not sure if we still include wed pm for student activities, and what about staff?? "
    },
    {
        "id": 0.245085013132,
        "content": "Steve, one of our key priorities for our new Strategic Plan will focus on the Student Experience. In fact, we are discussing two related topics in this regard:The Student Learning ExperienceThe Student Lived (extracurricular) ExperienceWhat are your thoughts on these? You,ve just referred to 'learning'.Are these issues that you addressed at Massey? "
    },
    {
        "id": 0.245085013132,
        "content": "Hi James -Yes: but not just quicker - also cheaper! Current public transport fares are, I think, too high relative to costs of car transport - certainly in terms of \"marginal\" or additional costs per journey (for people who are already \"carrying\" the capital and annual insurance/maintenance costs of a car). Alternatively, one could say that the (marginal) costs of car transport are too low compared to public transport. So I would say that a serious policy intended to achieve signifcant mode share switch to public transport needs action both on the routes and network connectivity of public transport but also absolute costs.... But, for the time being at least, that does not seem to be within the \"world view\" of our political system. While a university cannot fix this directly (we're not responsible for the provision of transport after all!) are there ways we can exert significant influence? Either by modelling different approaches (at our own cost!?) or campaigning (should universities do that?) or by public \"expert\" commentary (if we have expertise to offer)? Other ideas? "
    },
    {
        "id": 0.245085013132,
        "content": "I've used this link - https://www.dcu.ie/estates/helpdeskI run events with societies so generally will report problems with the rooms we host events in, like flickering lights "
    },
    {
        "id": 0.245085013132,
        "content": "What I like about the Generation 21 Graduate Attributes is that they recognise a university education is NOT just about getting a good job. In a nutshell I see our high-level attributes as preparing critical thinkers, critical consumers and critical citizens who can reshape our communities and societies. "
    },
    {
        "id": 0.245085013132,
        "content": "Should the high priority be the capacity/areas at DCU that achieves all of these? I guess this would come back to @Brian_MacCraith comment 'A key issue for us will be the identification of our key research strengths'. "
    },
    {
        "id": 0.245085013132,
        "content": "Ceist agam daoibh. Ní labharaimid faoi seirbhisí trí Ghaeilge a úsáid lasmuigh den rang m.sl déaleáil leis an gClárlann nó Aontas na Mic Léinn. Aon moltaí agaibh conas gur féidir linn na seirbhisí sin a fheasbhú? "
    },
    {
        "id": 0.245085013132,
        "content": "Ní labharaimid faoi seirbhisí trí Ghaeilge a úsáid lasmuigh den rang m.sl déaleáil leis an gClárlann nó Aontas na Mic Léinn. Aon moltaí agaibh conas gur féidir linn na seirbhisí sin a fheasbhú? "
    },
    {
        "id": 0.245085013132,
        "content": "I think we should definitely talk about accommodation.  Rents in Dublin are skyrocketing, and the city may unfortunately  become unaffordable for students.  Any ideas guys? "
    },
    {
        "id": 0.245085013132,
        "content": "@TrevorHolmes DCU has a lot it can offer internationally. I think it is a question of finding a niche in different countries. You also need to make sure that only relevant programmes are promoted. For instance, your school of law does not seem to offer LLB degrees. In some countries, (example is Nigeria) it will be extremely difficult to go to Law School if your law degree is not LLB. Some online programmes may have to incorporate some classroom activities, may in the final year. "
    },
    {
        "id": 0.240489083051,
        "content": "I think this is critical Mark. So we have to decide, what do we value? I think this is crucial. At an earlier session about graduate attributes, it was commented that \"We cannot all be leaders and innovators, and we cannot all be excellent communicators, etc. Does it mean that those who are not, for whatever reason, are not to be valued by society? Do they not still have a major role to play?\" I completely agree that we can't expect all our students to be brilliant at all the graduate attributes. So fundamentally, how do we decide what we value? "
    },
    {
        "id": 0.240489083051,
        "content": "This isn't a DCU problem (in fact we are better than most), but having toured a number of academic institutions we are seeing radically different processes across units.  The older a University gets, the more significantly this problem manifests.  We have seen it to some extent when discussing Anonymous mark entry - different departments all wanting their own processes implemented, when it fact they were trying to achieve the same thing. "
    },
    {
        "id": 0.240489083051,
        "content": "Since the economic downturn of 2008, the state grant to higher education institutions has fallen by 38%. Overall funding has fallen by nearly 14% at a time when full-time student numbers increased by 25% (QQI, 2016). "
    },
    {
        "id": 0.240489083051,
        "content": "Oops...should have mentioned that there is nothing wrong with coffees and social gatherings (!) - but it's just not for everyone! "
    },
    {
        "id": 0.235952400203,
        "content": "True, but when we are preparing students for jobs that do not yet exist, skills such as critical thinking and problem solving are even more crucial "
    },
    {
        "id": 0.235952400203,
        "content": "Agree it should be scored equally! also, it should be a critical component for all promotions. "
    },
    {
        "id": 0.231475216501,
        "content": "... tinder for DCU ?  Swipe right, swipe left ?  NO ! "
    },
    {
        "id": 0.231475216501,
        "content": "My past experience in launching Massey Worldwide is that there is no one single design and delivery model. See... "
    },
    {
        "id": 0.231475216501,
        "content": "Trish - from a DCU student accommodation perspective, every common room has two bins for waste segregation (burn &amp; recyclable) with a separate \"glass only\" bin as well. I always wondered why it is not also implemented across the general campus. "
    },
    {
        "id": 0.231475216501,
        "content": "Agreed Darragh - BYOD brings up the 'Control vs Chaos' argument.  Some of the issues with BYOD that would need to be addressed: "
    },
    {
        "id": 0.227057740603,
        "content": "To add to Alan''s points - it's not that the research direction/strategy doesn't count at all - but it becomes burdened by teaching priorities - and in some cases what one teaches and what one researches can differ significantly, thereby creating additional tensions. And each such junior academic feels a heavier burden because of these conflicting responsibilities. And then there's the matter of \"how much can I as a junior staff member push to have time/resources to do research\" and how much support for pursuing research we might get from school/faculty... It differs significantly by school and faculty, of course, but it is an issue that needs to be discussed. "
    },
    {
        "id": 0.227057740603,
        "content": "I survived the introduction of 30kph in city centre, but I'm not sure I could survive the wrath of the DCU employees "
    },
    {
        "id": 0.222700138825,
        "content": "GregA key issue for us will be the identification of our key research strengths. "
    },
    {
        "id": 0.222700138825,
        "content": "resources are always scarce so can we lever in more through strategic partnerships Andrew? "
    },
    {
        "id": 0.222700138825,
        "content": "Tá an-chuid taighde den scoth ar an nGaeilge ar siúl ag daoine éagsúla trasna na hollscoile. D'fhéadfadh tionchar níos mó a bheith ag an obair seo dá dtiocfadh daoine le chéile faoi lárionad. Ní neart go cur le chéile! "
    },
    {
        "id": 0.222700138825,
        "content": "We though about the feedback idea. We did not get to any concrete ideas in terms of how to do that in an efficient way, that does not look too invasive. Any suggestions here? "
    },
    {
        "id": 0.222700138825,
        "content": "GregA key issue for us will be the identification of our key research strengths. "
    },
    {
        "id": 0.218402536098,
        "content": "As a daily commuter from Drogheda, I somewhat feel as if I miss out on some aspects of student life such as society events,it isn't their fault at all, just my perspecctive. "
    },
    {
        "id": 0.218402536098,
        "content": "No I do not think we set our ambitions lower we have lots of research to show that once a student enters DCU then entry points do not affect performance. You may be interested in looking at our new outreach programme which has undergone radical change in the last 3 years. "
    },
    {
        "id": 0.218402536098,
        "content": "I feel there is also a degree of apathy towards student politics in certain sectors of the university. My undergraduate class showed no interest in student politics. We only had class reps in Second Year because the head of our course asked us to elect people. Also, most poeple in my course were uninterested in society life. "
    },
    {
        "id": 0.218402536098,
        "content": "Taking the conversation in a slightly different direction. As an organisation we should strive to NOT send emails to colleagues outside of the typical working hours for most (evenings and weekends). I have been guilty of this myself but am making a big effort not to do this. "
    },
    {
        "id": 0.214165016957,
        "content": "Absolutely agreed, the \"acting up\" situation for some of the staff is outrageous and nothing short of exploitation after so many years. "
    },
    {
        "id": 0.214165016957,
        "content": "Did you go from school straight to university? Did you have any grinds or attend a grind school at all? "
    },
    {
        "id": 0.214165016957,
        "content": "We also give those who miss out in the points \"rat race\"a second chance at Third level education giving easy access to students over 23 in our Open Education undergraduate degrees. "
    },
    {
        "id": 0.209987626574,
        "content": "I agree Rachel - students could then have the option (but not be restricted to it) of choosing that particular charity or the broader cause, for curricular and extra-curricular projects. We could have more cumulative impact on one cause in one year and then move on to another cause the following year - my hackathons via Clubs and Socs revealed many students concerned about mental health. DCU should pick a 'cause of the year' through a bottom-up approach thus getting more buy-in. "
    },
    {
        "id": 0.20181322226,
        "content": "Iontach an plé seo a fheiscint i lár an Aonaigh. Tar éis a bheith ag obair le mic léinn fud fad na tíre le cúpla bliain anuas is cinnte go braithim go bhfuil áit níos lárnaí ag an nGaeilge i DCU le cúpla bliain anuas! "
    },
    {
        "id": 0.20181322226,
        "content": "Tá go leor daoine le Gaeilge ag obair noi ag staidéad sa Ollscoil. An bhfuil smaointe ag aon duine faoi na bealaí is fearr le deiseanna úsáide a chur ar fáil do na daoine sin? Arbh fhiú Coiste na Gaeilge a bhunú? An mbeadh suim agat ann? "
    },
    {
        "id": 0.20181322226,
        "content": "An féidir linn an smaoineamh a oscailt amach le taighde trí Ghaeilge go ginearálta - comhfhiontar idir na dáimhe/scoileanna/aonaid éagsúla go bhfuil taighde den chineál sin ar siúl?? "
    },
    {
        "id": 0.20181322226,
        "content": "Ag súil go mór leis an phlé seo faoin Ghaeilge in DCU. Ó thosaigh mise san Ollscoil in 2013 tá borradh mór tagtha faoin Ghaeilge ar na campais éagsúla. Ach sílim gur ceann de na rudaí is mó atá de dhith anois ón phobal in DCU ná a bheith in ann seirbhísí a lorg agus a fháil trí mheán na Gaeilge. Ba chóir go mbeadh rogha ann do mhic léinn agus iad ag clárú, ag fáil torthaí, ag líonadh isteach foirm ar bith,ag déanamh teagmháil ar bith leis an Ollscoil a bheith in ann é a dhéanamh i nGaeilge. Sílim gur léiriú measa a bheadh ann dúinne atá ag maireachtáil trí mheán na Gaeilge. Dár ndóigh tá neart eile le déanamh ó thaobh na Gaeilge de ach sílim ó thaobh fhoirinn na hollscoile de gur seo rud atá de dhith. Bhí comhrá spéisiúil mar gheall ar Straitéis Ghaeilge DCU agamsa, Siobhán agus dreamanna éagsúla in DCU agus is léir go bhfuil suim ann. Tuigim go bhfuil siad buartha faoi éileamh caipéisí srl i nGaeilge ach mura bhfuil an seirbhís ar fáil agus feiceálach ní bheidh duine ar bith á lorg! "
    },
    {
        "id": 0.20181322226,
        "content": "following on from this, what have been the most challenging unplanned consequences you've experienced? "
    },
    {
        "id": 0.20181322226,
        "content": "An féidir linn an smaoineamh a oscailt amach le taighde trí Ghaeilge go ginearálta - comhfhiontar idir na dáimhe/scoileanna/aonaid éagsúla go bhfuil taighde den chineál sin ar siúl?? "
    },
    {
        "id": 0.20181322226,
        "content": "I would agree very much with what Clare says, Glasnevin Campus can be a lonely place despite the number of people.  No one seems to know each other, there is no designated area for staff to grab a cup of tea together like in SPD, it all about beating the rush at lunch or break time. At the induction, our guide seemed almost proud that the culture of a staff room in DCU did not exist. "
    },
    {
        "id": 0.20181322226,
        "content": "Ba bhreá liom rud cosúil le sin a fheiceáil ar campas Ghlas Naíon. Tá an Languaculture Space ann ach ba chóir go mbeadh seomra atá don Ghaeilge amháin. "
    },
    {
        "id": 0.20181322226,
        "content": "Ba bhreá liom rud cosúil le sin a fheiceáil ar campas Ghlas Naíon. Tá an Languaculture Space ann ach ba chóir go mbeadh seomra atá don Ghaeilge amháin. "
    },
    {
        "id": 0.20181322226,
        "content": "Ag súil go mór leis an phlé seo faoin Ghaeilge in DCU. Ó thosaigh mise san Ollscoil in 2013 tá borradh mór tagtha faoin Ghaeilge ar na campais éagsúla. Ach sílim gur ceann de na rudaí is mó atá de dhith anois ón phobal in DCU ná a bheith in ann seirbhísí a lorg agus a fháil trí mheán na Gaeilge. Ba chóir go mbeadh rogha ann do mhic léinn agus iad ag clárú, ag fáil torthaí, ag líonadh isteach foirm ar bith,ag déanamh teagmháil ar bith leis an Ollscoil a bheith in ann é a dhéanamh i nGaeilge. Sílim gur léiriú measa a bheadh ann dúinne atá ag maireachtáil trí mheán na Gaeilge. Dár ndóigh tá neart eile le déanamh ó thaobh na Gaeilge de ach sílim ó thaobh fhoirinn na hollscoile de gur seo rud atá de dhith. Bhí comhrá spéisiúil mar gheall ar Straitéis Ghaeilge DCU agamsa, Siobhán agus dreamanna éagsúla in DCU agus is léir go bhfuil suim ann. Tuigim go bhfuil siad buartha faoi éileamh caipéisí srl i nGaeilge ach mura bhfuil an seirbhís ar fáil agus feiceálach ní bheidh duine ar bith á lorg! "
    },
    {
        "id": 0.20181322226,
        "content": "Sin ar fheabhas. Maith dom m'aineolas ar an gceist. Bheadh sé iontach seo a fheiscint ag tarlúint do lucht B.Ed An bhfuil Gaeilge ag mórán léachtóirí nach mbíonn ag plé leis an nGaeilge? An bhféadfaí fíoríú ar léachtóirí áirithe léachtaí don chéad tseachtain den téarma a reachtáil trí Ghaeilge? An bhféadfadh seo tarlúint le linn Seachtain na Gaeilge leis? "
    },
    {
        "id": 0.20181322226,
        "content": "Sin ar fheabhas. Maith dom m'aineolas ar an gceist. Bheadh sé iontach seo a fheiscint ag tarlúint do lucht B.Ed An bhfuil Gaeilge ag mórán léachtóirí nach mbíonn ag plé leis an nGaeilge? An bhféadfaí fíoríú ar léachtóirí áirithe léachtaí don chéad tseachtain den téarma a reachtáil trí Ghaeilge? An bhféadfadh seo tarlúint le linn Seachtain na Gaeilge leis? "
    },
    {
        "id": 0.20181322226,
        "content": "Suimiúil. Dtiocfadh linn rud inteacht a fhorbairt thart air sin le go mbeadh cainteoirí Gaeilge abálta cainteoirí Gaeilge eile a aithint ar champas? "
    },
    {
        "id": 0.20181322226,
        "content": "Tá an-chuid rudaí ar fáil a chuidíonn le mic léinn atá ag iarraidh a bheith ag múineadh i ngaelscoileanna nó scoileanna Gaeltachta in OCBÁC. Is féidir an Ghaeilge a roghnú mar mhórspeisialachas, mionspeisialachas sa Ghaelscolaíocht agus tumoideachas a dhéanamh agus cuid de na hábhair oideachais a dhéanamh trí mheán na Gaeilge. "
    },
    {
        "id": 0.20181322226,
        "content": "Tá an-chuid rudaí ar fáil a chuidíonn le mic léinn atá ag iarraidh a bheith ag múineadh i ngaelscoileanna nó scoileanna Gaeltachta in OCBÁC. Is féidir an Ghaeilge a roghnú mar mhórspeisialachas, mionspeisialachas sa Ghaelscolaíocht agus tumoideachas a dhéanamh agus cuid de na hábhair oideachais a dhéanamh trí mheán na Gaeilge. "
    },
    {
        "id": 0.20181322226,
        "content": "I agree Claire that there are many reasons that inhibit students from taking up the opportunity to undertake an international experience.  How we incentivise students where there is no academic requirement to engage.  The fact that most of our students take a year rather than a single semester option could be one barrier. "
    },
    {
        "id": 0.20181322226,
        "content": "Exactly and it is about breaking down those cultures. Remember St Pats was a male only college up until 1971. There has been a gradual decline in males entering the teaching profession. http://www.thejournal.ie/gender-imbalance-irish-teachers-3018754-Oct2016/http://www.thejournal.ie/gender-imbalance-irish-teachers-3018754-Oct2016/ "
    },
    {
        "id": 0.197816111441,
        "content": "Ba mhaith liom go mbeadh DCU mar an cheannródaí idirnáisiúnta ó thaobh taighde agus teagasc don Ghaeilge agus trí Ghaeilge, go ndíreoidh sí ar spriocanna a mbeadh tionchar acu ar an sochaí agus go ndéanfaidh freastal ar na réimsí ar fad go bhfuil saineolas againn iontu trasna na dámha éagsúla! "
    },
    {
        "id": 0.197816111441,
        "content": "An-smaoineamh ar fad. Iarrfaimid ar Shiobhán Seoighe tabhairt faoin eolas sin a bhailiú. "
    },
    {
        "id": 0.197816111441,
        "content": "An-smaoineamh ar fad. Iarrfaimid ar Shiobhán Seoighe tabhairt faoin eolas sin a bhailiú. "
    },
    {
        "id": 0.197816111441,
        "content": "Is féidir linn - fair play don phobal as na smaointí ar fad agus as an bplé fiúntach! Ba mhaith liom go mbeadh DCU mar an cheannródaí idirnáisiúnta ó thaobh taighde agus teagasc don Ghaeilge agus trí Ghaeilge, go ndíreoidh sí ar spriocanna a mbeadh tionchar acu ar an sochaí agus go ndéanfaidh freastal ar na réimsí ar fad go bhfuil saineolas againn iontu trasna na dámha éagsúla! "
    },
    {
        "id": 0.197816111441,
        "content": "Tá mé leat a Edel. Déanann Siobhán an-mhórán obair ach mar a dúirt tú níl inti ach duine amháin agus tá na hacmhainní agus tacaíocht ceart de dhíobháil uirthi. "
    },
    {
        "id": 0.193878937824,
        "content": "Great that students are taking initiative but is there not an irony is selling plastic water bottles to raise funds for access to water projects - what are the links here to climate change and its' knock on effects on access to water?  This is why critical dialogue and support for students who are interested is essential "
    },
    {
        "id": 0.193878937824,
        "content": "No offence to Maynooth but why are DCU schools not linking in locally/regionally like this with Northside Partnership "
    },
    {
        "id": 0.193878937824,
        "content": "Graham, let me address the funding diversity issue upfront! As you will know, all HEIs are concerned about the funding situation and we await with interest the outcome of deliberations on the Cassells report. Nevertheless, in order to plan for a future where funding may remain at levels below what is required to deliver a high quality education, we plan to explore means of significant funding diversification (from non-exchequer sources). Could you envisage this becoming a norm in the future? "
    },
    {
        "id": 0.193878937824,
        "content": "I was referring to Henry grattan sorry! But yes if nursing students wish to study in there at night they would not be able too, which is discrimination. "
    },
    {
        "id": 0.190001566015,
        "content": "@David_Molloy, this may give a useful pointer for the way we organise groups to look at operational improvements (or even a future unit dedicated to this, were there to be one). I suggest that not only would the different perspectives about the actual issue need to be accommodated (as in academics, administrators, etc., in your example) but so also would be the underlying different perspectives - for example, some people tend first to think of technical issues, some of people issues, some of organisational issues.  I don't mean to imply that these things are all separate from one another but just to point towards trends. "
    },
    {
        "id": 0.190001566015,
        "content": "Access to healthy food during the day is not a problem as we're spoiled for choice with all of the restaurants and Spar on campus. The problem I have is the vending machines - some of them do have healthy snacks (nuts, cereal bars, etc.) but I think they should all be stocked half and half with \"healthy\" snacks and also bars and crisps for whoever wants them. "
    },
    {
        "id": 0.190001566015,
        "content": "I think the intranet is an excellent idea. It would allow people to follow conversations or postings of specific interest to them, either professionally or personally. I think everyone is suffering from email fatigue these days, and unfortunately, so much good news falls on deaf ears then. "
    },
    {
        "id": 0.186183827902,
        "content": "I am interested in views on enablers to diversity income or issues that act as impediment to same. And models to address same? "
    },
    {
        "id": 0.186183827902,
        "content": "An-smaoineamh. Tá daoine ar fud na hOllscoile a bhíonn i dteagmháil lena chéile go gairmiúil trí Ghaeilge ach má bhíonn tú i dteagmháil le duine nua, ní gá go mbeadh a fhios agat go bhfuil Gaeilge acu. Rud amháin a bhféadfaí cuimhneamh air ná síniú leictreonach a chur ag bun ríomhphost le 'Fáiltím roimh chomhfhreagras i nGaeilge' air (tá a leithéid in úsáid cheana féin ag cúpla duine). Dá mbeadh sé níos forleithne, chuirfeadh sé le timpeallacht thacúil don Ghaeilge san Ollscoil. "
    },
    {
        "id": 0.186183827902,
        "content": "Over the last few weeks the students have been outside the front of the street (hustings etc) I felt it created a real buzz on the campus (despite some noise warnings) "
    },
    {
        "id": 0.186183827902,
        "content": "Absolutely agree. We know the there are many students with disabilities in disadvantaged schools that are not identified.  we also know that some of the issues are to do with lack of resources in those schools, and the cost of getting a diagnosis. "
    },
    {
        "id": 0.186183827902,
        "content": "We need to encourage people to take a away from their desk. Go meet someone for a chat or a walk and not stay in isolation in their office. Set up a walking group at lunchtime so people can just meet and go for a walk around the park. "
    },
    {
        "id": 0.182425523806,
        "content": "It's not easy but I would be very slow to drop our traditional denominated-entry approach and follow the crowd and move to a general entry model. "
    },
    {
        "id": 0.182425523806,
        "content": "You're dead right Mahon.  Assuming math and/or programming skills that the class doesn't have makes for a stressful mess.  Most lecturers often don't pull out the 'hard stuff' until the second half of the term, which sounds sensible but it's awful because there's no time to catch up, while also doing everything else (assignments, lectures, full time job, kids, etc - brutal). "
    },
    {
        "id": 0.182425523806,
        "content": "AndrewMany of our older learners who are not registered students have this query.  As far as I know if you have student card on for example the Intergenerational Learning Programme you can use the library but not take out books.  Otherwise there is a charge to use it - but maybe I am incorrect on this? "
    },
    {
        "id": 0.182425523806,
        "content": "I think it can.  The practical difficulties with paying staff mean that it becomes much more cumbersome than it should be. "
    },
    {
        "id": 0.182425523806,
        "content": "As we have moved to a multi-campus environment my preference would be to focus on a global-neighbourhood rather than a global village as I believe it needs to be evident across all campuses and not confined to one. "
    },
    {
        "id": 0.182425523806,
        "content": "As someone who was 17 when they started University you do feel that there are not many events you can participate in because you are not 18 and this can make settling in during the first few weeks/months harder "
    },
    {
        "id": 0.178726423659,
        "content": "Thanks for the insights David. Hopefully Ireland can escape its political inertia on this critical issue. "
    },
    {
        "id": 0.178726423659,
        "content": "I eventually, through my own investigations, found the answers to these questions, however my concern is that future athletes across all of DCUs sports who might be a bit outside the 'sports loop' being on different campus' or in different buildings might find it difficult to source such facilities/might be afraid to ask as they fear they are 'not good enough' etc. An option to just be able to access these types of facilities/book online in your own time would be useful rather than having to go to ask someone to ask someone else to see you/book you in - I often feared that I was bothering someone/taking up their time by asking. "
    },
    {
        "id": 0.175086268164,
        "content": "B'fhiú aon rud atá le scríobh agat a dhéanamh inniu. B'fhiú dúinn ar fad teacht le chéile tar éis seo  Beidh an Adapt Centre a bhailiú an t-eolas le chéile do na comhráití ar fad. "
    },
    {
        "id": 0.175086268164,
        "content": "Poor writing skills. For example, use of Hiberno-English when the target language is EN-GB, incorrect spelling of common past participles, and careless typos. Text speak in their email communications. "
    },
    {
        "id": 0.175086268164,
        "content": "Hi all, I was in DCU until 1996. Didn't have much of a student life as I was commuting from Tallaght every day and still had my 'old' life going on there. Kind of regret now not getting more involved which is kind of ironic given that I'm  back at DCU every week now with CoderDojo! "
    },
    {
        "id": 0.175086268164,
        "content": "Like any large, complex organisation with multiple 'business lines'/funding sources this will bring inevitable tensions....trying to balance competing demands. I think being crystal clear about values is essential in navigating this tension "
    },
    {
        "id": 0.167981614866,
        "content": "I  was always a believer that  students should get involved with the issues that involve them directly in college - this could be libraries, catering - or even parking . I think students that get involved in issue in front of them will sequentially take on the bigger issues like third level access,climate change etc "
    },
    {
        "id": 0.167981614866,
        "content": "Hi, apologies i'm late to the conversation but I think DCU should be making it easier for students to live sustainable lives in small gestures, which is currently not the case.In order to buy salad, you are forced you use a wasteful plastic container instead of the perfectly good plates sitting next to the salad bar.We are also not encouraged to bring our own food in lunch boxes, as we are hassled by the library and gym cafe staff to not eat our own food on their premises, we aren't exactly spoiled for choice on places to sit that aren't owned by an external company. "
    },
    {
        "id": 0.164516462897,
        "content": "I agree that engagement is a major issue but there are smaller issues with the university. For example while efforts have been done to reduce printing and waste there are some courses which require massive amounts of printing, most of which won't be looked at again once the semester is over! "
    },
    {
        "id": 0.164516462897,
        "content": "I agree they lose out on the supports and also that staff are not judgemental. I keep telling students that if they are struggling with an assessment format or understanding concepts... then it is a problem for me to solve. "
    },
    {
        "id": 0.164516462897,
        "content": "Very difficult for a postdoc to live off 31 k. Senior postdocs, like me, could have kids and childcare to pay out of that. This of course is not a DCU specific issue. "
    },
    {
        "id": 0.164516462897,
        "content": "@Postgraduate_Society This is a conerrn for all of us.  A lot of the ca 5,500 new student beds being build in Dublin will be based between the canals and will be more expensive than the current DCU accommodation rates.   Construction cost inflation is running at 8%+ p.a. and this is being reflected in rental levels in new developments.  The ca 800 new DCU on-campus student beds will come on line in the next 3 years. "
    },
    {
        "id": 0.164516462897,
        "content": "I don't know Paul. I can see a value in it but I am also worried about increasing bureaucratisation and the dangers inherent in yet another gateway before submission. Add to this - and this is in no way disrespectful to our research support colleagues - but many of us are very experienced in targeting  funding calls e.g I have been applying for E+ and predecessor programmes since mid 90's - and I am not sure if there is massive value in having another oversight stage for someone like me. I am sure other colleagues are in the same position? "
    },
    {
        "id": 0.164516462897,
        "content": "I feel staff should have their own chill out space. "
    },
    {
        "id": 0.161108949577,
        "content": "Hi Barry - yes, it's a logistical nightmare. Could be delivered on-line or in flipped classroom, and only one teacher needed. The problem would be in assessment. But once the decision is made, I'm sure the TEU would rise to the challenge! "
    },
    {
        "id": 0.161108949577,
        "content": "The class touched on cultural anthropology, cross culture mgmt, adapting to new business environments, working with and across cultures etc. Also how to deal with culture shock which was an issue for many people in the different academic environment which resembled Leaving Certificate study patterns more closely. "
    },
    {
        "id": 0.161108949577,
        "content": "Since all of Dublin and even all of Ireland now is a sort of sparse  suburbia, Mees' book says a great deal about why reducing congestion for cars should NOT be an aim of transport policy (as it is in Dublin and Ireland). "
    },
    {
        "id": 0.157758687019,
        "content": "Martin, not sure if this is for a forum such as FUSE, but recently I participated on a Staff Development Programme on campus, which was excellent.  But at break time, each person took their coffee back to their desk (!!!), and lunch was not included so staff did their own thing, so there was no interaction at all.  I felt it was a lost opportunity to meet new people. "
    },
    {
        "id": 0.157758687019,
        "content": "Is there the possibility to expand the Leadership POD beyond the clubs and societies scope so that people not affiliated with societies could attend if it suits them? I feel there are some essential skills that the workshops teach. Although, as someone who is on a committee, I feel the approach of how they are advertised to us is all wrong-- the threat of having funds reduced for not attending makes them feel like a chore rather than a learning opportunity. "
    },
    {
        "id": 0.157758687019,
        "content": "It's a very complex issue. Our Clubs Officer is doing research on adding a levy and asking the students if they want this. "
    },
    {
        "id": 0.154465265084,
        "content": "That's the big thing here.  Its not necessarily getting elected, but running for election is the critical step.  Its putting your head up, taking risks "
    },
    {
        "id": 0.154465265084,
        "content": "We did indeed. Apologies for my forgetfulness. Could we talk offline at some point that suits you about future collaborations?. My email is patrick.cadwell@dcu.ie "
    },
    {
        "id": 0.154465265084,
        "content": "I apologise for this being a bit 'high performance/scholarship athlete' focussed, being a scholarship athlete myself who in the past felt a bit 'out of the sports loop' I can only imagine how daunting it could be for someone trying to get involved at beginners level. "
    },
    {
        "id": 0.148047198032,
        "content": "Which implies that equality of access to education is at least in part dependent on equality of access to medical services - not a connection I would have made before "
    },
    {
        "id": 0.148047198032,
        "content": "Coiste na Gaeilge - nó Grúpa Gnímh nó a leithéid. Smaointiú ar dóigh atá ansin. Sílim nach bhfuil sé ceart ná cóir go bhfuil an oiread de scoilt idir na grúpaí éagsúla ar champas a bhíonns ag plé leis an Ghaeilge - mar shampla, mic léinn le Gaeilge, muintir an Chumainn Ghaelaigh, baill foirne le Gaeilge, Oifigeach Gaeilge, srl. "
    },
    {
        "id": 0.148047198032,
        "content": "Sílim go bhfuil féidearthachtaí iontacha ann faoin Scoil nua agus bheinn dóchasach go bhfásfaidh rudaí maithe as an teacht le chéile. Pobal bríomhar ag plé le réimsí ilghnéitheacha den Ghaeilge/den saol acadúil/den oideachas, srl - ag mar a deir sibh - aithne a chur ar a chéile! "
    },
    {
        "id": 0.144921631488,
        "content": "At DCU we aim to create a culture that is inclusive at all levels and in every system and process. Where students, faculty and staff demand the highest standards from each other. Through our equality, diversity and inclusion action planning, we aim to build an environment where we embrace and celebrate our visible and invisible differences. "
    },
    {
        "id": 0.1418510649,
        "content": "Is Finance or access to resources an impediment to innovation? Or when does it become an impediment? "
    },
    {
        "id": 0.138834993547,
        "content": "loss of time, duplication and working harder, not smarter are the unfortunate results "
    },
    {
        "id": 0.132964240198,
        "content": "Deirdre I guess LEARNING is complex and messy! "
    },
    {
        "id": 0.132964240198,
        "content": "This might underpin the discussion about the development of a \"university quarter\" that has come up in other threads. My concern was that the Glasnevin campus lacks the surrounding urban characteristics we might need to develop the idea but I guess we could see the Glasnevin campus itself as an urban setting and go from there. "
    },
    {
        "id": 0.132964240198,
        "content": "Diversity simply means difference. Visible and invisible dimensions which combine to make each of us a unique individual. We are all diverse and diversity is about all of us.. "
    },
    {
        "id": 0.124553358187,
        "content": "Gosh yes Daire: I loath food waste. Is this partly a generational thing in Ireland? I feel I'm showing my age. When I was growing up, wasting food was practically a \"mortal sin\". "
    },
    {
        "id": 0.124553358187,
        "content": "I think we need an all year round social space, particularly in the summer months when hundreds of international language students have no place to relax and end up sitting or lying on building corridors "
    },
    {
        "id": 0.12185285077,
        "content": "I think one issue is that too many think about the big itens, world peace, famine, and not enough about small issues that affect their lives, and to which they can effect change - like the housing crisis, investment in public transport, cycle infrastructure etc. "
    },
    {
        "id": 0.12185285077,
        "content": "A worrying trend is emerging in DARE applications.which show that the highest amount of applications.come from students.who have attended grind schools. The system is currently under review "
    },
    {
        "id": 0.119202922022,
        "content": "Tá spéis ag cuid againn forbairt ar dhéanamh ar an láithreacht atá ag an nGaeilge ar líne...an bhféadhfaidh an Ollscoil cuidiú linn ar aon bhealach? Ag glacadh leis an tábhacht a bhaineann leis an Idirlíon,  na meáin shóisialta agus mar sin... "
    },
    {
        "id": 0.119202922022,
        "content": "Neil creidim ba chóir go mbeadh láthair ann don Ghaeilge ar gach campas, chomh maith leis an gcampas fíorúil, ní mhiste go mbeadh an Ghaeilge i lár an aonaigh ar chuile champais. Ceapaim go bhfuil an toil sin ann fosta! "
    },
    {
        "id": 0.119202922022,
        "content": "Eoin, dont know who you could be referring to as a loud  careerist - moi? !!!  Never ! Let students decide what issues they want to take up, and how they want to do it . I come back to one college where I know something about TCD - I am astonished in 2017 that students still have so little say in how they are taught, examined, when by who etc . And yes , if students think parking is an issue , let them campaign on it . "
    },
    {
        "id": 0.119202922022,
        "content": "Indeed. The trick of course is to do it without becoming politicised. Unfortunately we can't write a computer programme but we can keep contributing. "
    },
    {
        "id": 0.119202922022,
        "content": "Cad a cheapann sibh faoi pop-up Gaeltacht lá éigin sa mhí ar champas éagsúil!  Agus eachtraí a eagrú ar an lá sin a bhainneann leis an nGaeilge ar an gcampas sin. "
    },
    {
        "id": 0.119202922022,
        "content": "Cad a cheapann sibh faoi pop-up Gaeltacht lá éigin sa mhí ar champas éagsúil!  Agus eachtraí a eagrú ar an lá sin a bhainneann leis an nGaeilge ar an gcampas sin. "
    },
    {
        "id": 0.119202922022,
        "content": "Cad a cheapann sibh faoi pop-up Gaeltacht lá éigin sa mhí ar champas éagsúil!  Agus eachtraí a eagrú ar an lá sin a bhainneann leis an nGaeilge ar an gcampas sin. "
    },
    {
        "id": 0.119202922022,
        "content": "Cinnte - agus tionchar ansin ag na múinteoirí céanna ar oiread sin páistí agus scoileanna. Tá an fhorbairt ghairmiúil leanúnach agus an teagmháil leanúnach sin chomh tábhachtach "
    },
    {
        "id": 0.119202922022,
        "content": "Tá sé go hiontach gur chuidigh na cúrsaí sin leat. Cabhraíonn sé linn nuair a thagann éileamh ó na mic léinn mar go mbíonn obair sa bhreis i gceist na roghanna seo a chur ar fáil. "
    },
    {
        "id": 0.11405238128,
        "content": "In my opinion, multilingualism is not promoted enough in Irish society. Ireland has one of the highest rates to monolingualism in the EU and the general view is \"the whole world speaks English, so why should we learn another language?\" Unless we break that viewpoint, an immersive model would be met some resistance, I would imagine. "
    },
    {
        "id": 0.106690593946,
        "content": "An bhféadfaí \"Gaeltacht\" a chruthú ar champas ag tús gach téarma ar dtús le tuilleadh daoine a spreagadh le haithne a chur ar a chéile tríd Gaeilge ar dtús agus le pé Gaeilge atá acu a húsáid? "
    },
    {
        "id": 0.106690593946,
        "content": "What about creating institutions within working class communities that make the transition to third level less daunting and unusual? Institutions that will prepare students for the language and culture dominant in our universities. "
    },
    {
        "id": 0.106690593946,
        "content": "Cinnte - d'aontóinn leat. Agus, mar a deir tú, tá an t-éileamh sin ann i measc na mac léinn, sruth Gaeilge a bheith ann i ngach bliain den chúrsa. "
    },
    {
        "id": 0.106690593946,
        "content": "Maybe a way to introduce the bigger issues to students would be to replace a specific lecture with perhaps once off lectures from campaigners, environmentalists, homeless people, journalists/radio personalities (Joe?), etc. Bring the issues to the students then let them run with them.  Maybe they would need to be surprise topics, as if a student thinks they are not going to hear what's on the curriculum, they may opt out to go elsewhere for that lecture period. "
    },
    {
        "id": 0.0932147230818,
        "content": "Yes but as primary school and secondary schools move  away from an evidence/medical model to a needs based model the HE sector needs to look how this will impact on schemes like DARE and the Fund for Students with a disability but rely on a medical diagnosis. This is not an exclusive DCU problem but a sector issue. "
    },
    {
        "id": 0.0870657724403,
        "content": "Generally not a bad idea. UCD made that move some years ago and while there were several hurdles to overcome, they did so after a year or two. "
    },
    {
        "id": 0.085099045007,
        "content": "Is rud riachtanach é sin. Is fada uaim an Ghaeilge anois uaireanta toisc go bhfuilim lonnaithe i nGlas Naíon. Níl rud mór é domsa taistil go Droim Conrach chun bualadh le lucht na Gaeilge ach tá a fhios agam nach bhfuil an fonn sin ar gach éinne. "
    },
    {
        "id": 0.085099045007,
        "content": "An bhfuil aon mhórghníomh go bhféadhfaidh an Ollscoil a dhéanamh le freastal ar an nGaeilge sa sochaí taobh amuigh de na himeachtaí, na cláracha agus an obair atá idirlámh againn faoi láthair??? Tá spéis ag cuid againn forbairt ar dhéanamh ar an láithreacht atá ag an nGaeilge ar líne...an bhféadhfaidh an Ollscoil cuidiú linn ar aon bhealach? Ag glacadh leis go bhfuil an tábhacht leis an Idirlíon,  na meáin shóisialta agus mar sin... "
    },
    {
        "id": 0.085099045007,
        "content": "Smaointiú maith. Mar sin - an fearr lá/imeacht mór amháin gach mí/coicís, nó imeacht seachtainiúil (lón le Gaeilge nó cibé rud) "
    },
    {
        "id": 0.0831726964939,
        "content": "The opposite of sophistication can be a great break from the rough and tumble of the real world! "
    },
    {
        "id": 0.0831726964939,
        "content": "Following up on ideas around adult education, the key issue is to find a niche where DCU can fill a need not being met by others, rather than competing with them.  We have always been Ireland lead university in online and distance degree programmes, but we have not run an evening campus based degree programme in a while.  Is there a demand for that or is the demand for pre-degree 'foundation' programmes ? "
    },
    {
        "id": 0.079438549184,
        "content": "And I agree with you, Greg. We cannot all be leaders and innovators, and we cannot all be excellent communicators, etc. Does it mean that those who are not, for whatever reason, are not to be valued by society? Do they not still have a major role to play? "
    },
    {
        "id": 0.0776294625565,
        "content": "We need to encourage people to take a break away from their desk. Go meet someone for a chat or a walk and not stay in isolation in their office. Set up a walking group at lunchtime so people can just meet and go for a walk around the park. "
    },
    {
        "id": 0.0741240651907,
        "content": "The opposite of sophistication can be a great break from the rough and tumble of the real world! The new student hub could definitely be a platform. Sports are a massive way to keep the Alumni community involved and maybe that can be developed more as it's a break from networking / formal events. Perhaps earmarking one game in a particular code could work for an alumni gathering. "
    },
    {
        "id": 0.0724264853615,
        "content": "I believe DCU should provide more free or affordable sports &amp; health courses to staff. For example, some people would benefit from doing yoga or pilates once or twice a week during office hours (or just before or after work). Currently the only options are to enrol to DCU Sports (a private gym on campus) -- which ends up being expensive for just a couple of times a week -- or pay for one of the independent, private courses that are provided informally on campus. As an employer, DCU would also benefit from the improved health offered by those more 'therapeutic' types of physical activities. Think of repetitive strain injuries, back pains, etc suffered from people seating in a chair for long hours in their office and who are not regular sports practitioners. In other universities I have seen such courses offered through their equivalent of Learning &amp; Development. "
    },
    {
        "id": 0.0724264853615,
        "content": "This is an excellent point - both culture shock and reverse culture shock can be extremely unsettling for the traveling student. It might be worth having a discussion on the topic with students who aren't planning on studying abroad themselves, and who may not realize to what extent this can affect international students and the relationships they form while studying abroad. "
    },
    {
        "id": 0.0724264853615,
        "content": "4) Unfortunately, I saw examples of unprofessional attitudes or unrealistic industry expectations from translation graduates in interviews. This is a real blocker and I've not seen this with graduates from other colleges. For example, emails addressed to me as 'Hiya/Hey' during the interview process, late responses with no apology or heads-up. "
    },
    {
        "id": 0.0724264853615,
        "content": "I believe DCU should provide more free or affordable sports &amp; health courses to staff. For example, some people would benefit from doing yoga or pilates once or twice a week during office hours (or just before or after work). Currently the only options are to enroll to DCU Sports (a private gym on campus) -- which ends up being expensive for just a couple of times a week -- or pay for one of the independent, private courses that are provided informally on campus. As an employer, DCU would also benefit from the improved health offered by those more 'therapeutical' types of physical activities. Think of repetitive strain injuries, back pains, etc suffered from people seating in a chair for long hours in their office and who are not regular sports practitioners. In other universities I have seen such courses offered through their equivalent of Learning &amp; Development. "
    },
    {
        "id": 0.0691384203433,
        "content": "Yes. Applications like Whatsapp facilitate casual discourse, bonding, and support. Additionally, the distance students in my whatsapp groups express reluctance to post casually on the forums. We are concerned that questions or criticisms regarding the module or assignment briefs will offend the tutor or open education. Recently, a few of us experienced technical problems submitting an assignment during a weekend. The Whatsapp group provided vital support and a safe place to vent frustration. "
    },
    {
        "id": 0.0691384203433,
        "content": "We need to encourage people to take a break away from their desk. Go meet someone for a chat or a walk and not stay in isolation in their office "
    },
    {
        "id": 0.0675466911396,
        "content": "That is a very live issue here too, David -- as you probably know.There is a serious concern that Ireland might not be able to implement an 'income contingent loan' system. "
    },
    {
        "id": 0.0675466911396,
        "content": "Do mhic léinn B.ED agus mic léinn máistreachta don Oideachais mar shampla an bhféadfadh an bhliain tosnú sa Ghaeltacht? Is cuid riachtanach den gcúrsa é seal a chaitheamh sa Ghaeltacht nach ea? An bhféadfadh seo tarlúint ag tús na bliana le béim a bheith ar an nGaeilge ón dtús? Bheadh sé mar nós ag tuilleadh daoine Gaeilge a labhairt lena chéile braithim. "
    },
    {
        "id": 0.0675466911396,
        "content": "Bheadh an-tábhacht ag baint le Lárionad Taighde don Ghaeilge, a thógfadh ar na láidreachtaí ó thaobh theagasc na Gaeilge agus léann na Gaeilge agus a d'úsáidfeadh na huirlisí digiteacha le hábhar foghlama agus teagaisc a chruthú, a fhoilsiú agus a mheas go leanúnach. Tá gá le straitéis náisiúnta le haird a tharraingt ar an bhFráma Tagartha  Eorpach d'fhoghlaim teangacha. D'fhéadfaí dul ag obair i gcomhar le hollscoileanna eile agus leis an gComhairle Mhúinteoireachta leis an bhfráma sin a chur i dtuiscint do dhaoine. Ba chóir go dtuigfeadh mic léinn oideachais agus mic léinn BA atá ag déanamh staidéir ar an nGaeilge gur 'graduate attribute' atá i gceist nuair atá inniúlacht ar leibhéal B2 den Fhráma Tagartha á éileamh orthu. "
    },
    {
        "id": 0.0644647658376,
        "content": "To further prove my point I will give an example. Just this week on Tuesday we were told that a Thursday's lecture was cancelled, however this was only said in the lecture hall. No email was sent out so the people who were not in the lecture did not get this message and possibly showed up to the lecture on Thursday which was a waste of their time as the lecture was cancelled. Had the lectures been live streamed this would not have been an issue for majority of the students. "
    },
    {
        "id": 0.0644647658376,
        "content": "An issue I encounter very frequently is that people may feel overwhelmed or \"insignificant\" - they may say \"nothing I can do will make any difference to these global scale problems\". How might you respond to that? "
    },
    {
        "id": 0.062973356057,
        "content": "I have a serious concern about academic issue in colleges - Theresa ,in the world we live in is it not surprising that with comparison websites everywhere like bonkers.ie  collating and comparing information on prices, products etc that there isn't one for Third level colleges !!But a busy person gets more done - so getting involved in issues. Helps !! "
    },
    {
        "id": 0.062973356057,
        "content": "On the Glasnevin Campus, with the exception of the School of Nursing Building, it always strikes me that the ground floor of many of our larger buildings on campus are 'unfriendly'  with no outward facing reception/information areas. Walk into the Lonsdale Building, the Stokes Building, the Marconi Building or the McNulty Building and the atria/foyers are very dead spaces that have to be passed through but provide little in the in the way of welcome, way finding advice or human interaction. There is room for interactive touchscreens, intercoms linked directly to a central, manned information point etc. External 'information points' are also very useful for users unfamiliar with the campus. "
    },
    {
        "id": 0.0559880790618,
        "content": "In my experience, the problems people experience can be exacerbated or ameliorated by supervisor input. Some PG students are afraid to discuss their difficulties with a capricious supervisor, and explain why they haven't written anything for 3 months, other supervisors are \"too nice\" facilitating extension after extension, while the student may be unable on their own to make real changes. "
    },
    {
        "id": 0.0534033297998,
        "content": "Ba bhreá liom sin! Díreach an seomra a cur in áirithe (tá an coras sin le forbairt) ar an liosta "
    },
    {
        "id": 0.0474258731776,
        "content": "Sílim gur smaoineamh iontach é sin. An rud is deacair faoi sin ná go bhfuil teagasc na Gaeilge imithe ón gcampas Ghlas Naíon agus cuid mór de lucht na Gaeilge leis. Aon moltaí agat faoin chaoi gur féidir linn an teanga a spreagadh ar an campas sin? "
    },
    {
        "id": 0.0474258731776,
        "content": "Cinnte. Dá mbeadh Coiste Gnímh ann bheadh an tacaíocht sin ann agus ní thitfeadh cúramaí móra mar sin ar ghrúpa ar leith nach raibh in ann aige "
    },
    {
        "id": 0.0452174734833,
        "content": "If the funding remains static, and the demand for places continues to grow, some form of capping is inevitable,  or the quality of the system will be further compromised.  Capping will be very   unpalatable to the general public because in inevitably leads to students being denied access to programmes - especially in the context of Brexit where they may not be able to go and study in the UK...   No way around it... we need more money!! "
    },
    {
        "id": 0.0452174734833,
        "content": "Laura Hayes is a third year PhD student working with the Astrophysics Research Group at Trinity College Dublin. Her research focuses on the physics of our closest star - the Sun - and its magnetic activity. Solar flares are huge explosions of electromagnetic energy on the Sun which result from powerful magnetic fields that get too tangled and twisted. The intense radiation produced from a flare can cause adverse space weather effects on telecommunication, GPS and power systems, and so the understanding and prediction of flares is very important. Her work looks at the X-ray emission from solar flare events using spacecraft such as NASAs RHESSI mission together with other space based and ground observations to identify and classify the highly variable nature of solar flares. "
    },
    {
        "id": 0.0373268873441,
        "content": "B'fhiú an taighde faoin dea-fhoghlaimeoir teanga (Muiris Ó Laoire agus Karen Ní Chlochasaigh, mar shampla) agus an taighde faoi inimirceoirí a shealbhaigh an teanga (taighde Justin McCubbin) agus taighde a rinneadh faoi choimirce Fulbright agus Roinn na Gaeltachta faoi theagasc na Gaeilge i Meiriceá a cheadú ionas go mbeadh forbairtí sa réimse seo bunaithe ar dhea-chleachtas agus ar riachtanais an spriocphobail. Ba ghá an obair atá déanta ag muintir Ollscoil Mhá Nuad le TEG ( atá bunaithe ar an bhFráma Tagartha Eorpach agus ar thuiscintí ar dhea-chleachtas i gcúrsaí measúnaithe teanga) a chur san áireamh. B'fhiú go mór smaoineamh freisin ar an gcomhoibriú idir-institiúideach mar ní neart go cur le chéile má tá athruithe bunúsacha chun feabhais le cur i gcrích i dteagasc na Gaeilge go náisiúnta agus go hidirnáisinta. "
    },
    {
        "id": 0.0364388654208,
        "content": "Hi gach duine. Brón orm gur chaill mé cuid de.... melt down ag buachaill beag!smaoineamh a bhí agam féin mar gheall ar an Ghaeilge sa phobal anseo: maith dom má tá sé luaite ag duine eile faoin am seo.Sílim gur féidir le DCU an-obair a dhéanamh le cuidiú le ról na dtuismitheoirí maidir leis an Ghaeilge. Tá cuid mhór tuismitheoirí amuigh ansin atá ag iarrraidh cuidiú a fháil sa dóigh is go dtig leo féin cuidiú a thabhairt dá bpáistí. Níl san aireamh ansin na tuismitheoirí as tíortha eile atá ag iarraidh Gaeilge a fhoghlaim ach nach bhfuil sé d’achmhainn acu cuid mhór airgid a chaitheamh air seo.Chuir mé ranganna Gaeilge ar fáil do thuismitheoirí cheana féin agus bíonn an rud céanna le rá acu ar fad: “ní raibh a fhios agam go raibh an oiread sin Gaeilge agam”B’fhéidir go dtiocfadh linn cúrsa ar –líne a chur ar fáil a chuideodh leis na tuismitheoirí a bhfuil Gaeilge acu cheana féin agus na tuismitheoirí nach bhfuil Gaeilge ar bith acu. "
    },
    {
        "id": 0.0364388654208,
        "content": "Hi gach duine. Brón orm gur chaill mé cuid de.... melt down ag buachaill beag!smaoineamh a bhí agam féin mar gheall ar an Ghaeilge sa phobal anseo: maith dom má tá sé luaite ag duine eile faoin am seo.Sílim gur féidir le DCU an-obair a dhéanamh le cuidiú le ról na dtuismitheoirí maidir leis an Ghaeilge. Tá cuid mhór tuismitheoirí amuigh ansin atá ag iarrraidh cuidiú a fháil sa dóigh is go dtig leo féin cuidiú a thabhairt dá bpáistí. Níl san aireamh ansin na tuismitheoirí as tíortha eile atá ag iarraidh Gaeilge a fhoghlaim ach nach bhfuil sé d’achmhainn acu cuid mhór airgid a chaitheamh air seo.Chuir mé ranganna Gaeilge ar fáil do thuismitheoirí cheana féin agus bíonn an rud céanna le rá acu ar fad: “ní raibh a fhios agam go raibh an oiread sin Gaeilge agam”B’fhéidir go dtiocfadh linn cúrsa ar –líne a chur ar fáil a chuideodh leis na tuismitheoirí a bhfuil Gaeilge acu cheana féin agus na tuismitheoirí nach bhfuil Gaeilge ar bith acu. "
    },
    {
        "id": 0.0364388654208,
        "content": "Hi gach duine. Brón orm gur chaill mé cuid de.... melt down ag buachaill beag!smaoineamh a bhí agam féin mar gheall ar an Ghaeilge sa phobal anseo: maith dom má tá sé luaite ag duine eile faoin am seo.Sílim gur féidir le DCU an-obair a dhéanamh le cuidiú le ról na dtuismitheoirí maidir leis an Ghaeilge. Tá cuid mhór tuismitheoirí amuigh ansin atá ag iarrraidh cuidiú a fháil sa dóigh is go dtig leo féin cuidiú a thabhairt dá bpáistí. Níl san aireamh ansin na tuismitheoirí as tíortha eile atá ag iarraidh Gaeilge a fhoghlaim ach nach bhfuil sé d’achmhainn acu cuid mhór airgid a chaitheamh air seo.Chuir mé ranganna Gaeilge ar fáil do thuismitheoirí cheana féin agus bíonn an rud céanna le rá acu ar fad: “ní raibh a fhios agam go raibh an oiread sin Gaeilge agam”B’fhéidir go dtiocfadh linn cúrsa ar –líne a chur ar fáil a chuideodh leis na tuismitheoirí a bhfuil Gaeilge acu cheana féin agus na tuismitheoirí nach bhfuil Gaeilge ar bith acu. "
    },
    {
        "id": 0.0347234295334,
        "content": "Cinnte dearfa. Sin é an rud a bhí i gceist agam. Uaireanta ní thuigeann daoine taobh amuigh de phobal léann na Gaeilge go bhfuil an diminsean idirnáisiúnta den taighde chomh tábhachtach sin. Tá na hacmhainní digiteacha in úsáid ar fud an domhain -  is iad anois an nasc laethúil atá ag an diaspora Gaelach agus foghlaimeoirí na teanga ar fud an domhain leis an nGaeilge. Beidh comhdháil mhór idirnáisiúnta trí mheán na Gaeilge ar siúl in Ollscoil Shéarlais i bPrág i mí Mheán Fómhair, an chéad uair a eagraíodh comhdháil go hiomlán trí Ghaeilge thar lear. "
    },
    {
        "id": 0.0330859783887,
        "content": "Braitheann sé ar an 'buy-in' a bheidh ag daoine eachtraí a heagrú. Ní féidir le hOifigeach an Gaeilge gach rud a dhéanamh. Má tá suim ag pobal na Gaeilge i DCU freastal ar heachtraí trí Ghaeilge (pé leibhéal Gaeilge atá agat), bhuel caithfidh siad bheith ann ón gcéad lá chun na heachtraí sin a chur ar siúil. D'eagraigh ceathrar nó cúigear againn i gColáiste Phádraig Ciorcal Comhrá seachtainiúil, ach bhí sé deacair é a eagrú gach seachtain idir an ghrúpa sin, mar bhí daoine gnóthach lena jabanna fhéín. So i mo thuairimse, tá sé tabhacht go mbeadh córas tacaíochta ann (de dhaoine) chun na heachtraí seo a chur a siúil. "
    },
    {
        "id": 0.0330859783887,
        "content": "Braitheann sé ar an 'buy-in' a bheidh ag daoine eachtraí a heagrú. Ní féidir le hOifigeach an Gaeilge gach rud a dhéanamh. Má tá suim ag pobal na Gaeilge i DCU freastal ar heachtraí trí Ghaeilge (pé leibhéal Gaeilge atá agat), bhuel caithfidh siad bheith ann ón gcéad lá chun na heachtraí sin a chur ar siúil. D'eagraigh ceathrar nó cúigear againn i gColáiste Phádraig Ciorcal Comhrá seachtainiúil, ach bhí sé deacair é a eagrú gach seachtain idir an ghrúpa sin, mar bhí daoine gnóthach lena jabanna fhéín. So i mo thuairimse, tá sé tabhacht go mbeadh córas tacaíochta ann (de dhaoine) chun na heachtraí seo a chur a siúil. "
    },
    {
        "id": 0.0330859783887,
        "content": "Tá daoine ar gach campas le Gaeilge, níl dabht ar bith agam fá sin! Ach amháin nach bhfuil aithne ag gach cainteoir Gaeilge ar a chéile (cé gur minic a bhíonn sé amhlaidh). Bhí mé ag smaointiú ar dhaoine taobh amuigh de \"phobal DCU\" fosta, muintir na háite agus mar sin de "
    },
    {
        "id": 0.0322954646985,
        "content": "smaoineamh maith! agus b'fhiú go mór taighde a dhéanamh air sin. Mar a dúirt mé, tá sé déanta agam féin ach ní raibh ach tuismitheoirí i gceist leis sin. "
    },
    {
        "id": 0.0293122307514,
        "content": "Teach na Gaeilge i gceart de dhith go mór. Pobal láidir, bríomhar ar achan champas chun cinntiú go bhfuil an Ghaeilge feiceálach agus cloiste in achan ghné de shaol na hollscoile. Bheadh freagrachtaí agus dualgais ar na mic léinn sa scéim agus iadsan mar aon leis an Chumann Gaelach urlabhraí na Gaeilge i measc na mac léinn. Le feiceáil óna leithéid de UCD go noibríonn sé agus gur chuid den mhórphobal gníomhach Gaeilge iad go fóill mar gheall ar an taithí sin. "
    },
    {
        "id": 0.0279225737841,
        "content": "I'm a current 2nd year business student, I know it's a long shot but perhaps live streaming of lectures would be a possibility in the future? Now I know some might criticize this idea as students will not feel as though attending lectures is necessary, but the reality is that the students who always go to lectures will continue attending, this idea is aimed at students who cannot, for legitimate reasons make the lectures. Being in second year and doing INTRA next year I was forced to miss several lectures due to interviews, while the PowerPoints are online I am still missing out on the lecturers examples and suggestions. If the lectures were live streamed I could have watched them on the bus and not felt as though I was missing out. I am confident that many other students feel the same way, as the interviews are based around the end of the semester we are missing out on critical information which is mentioned in the lectures. "
    },
    {
        "id": 0.0259573571978,
        "content": "There's a difference between student politics and students involved in politics. People might be cynical about student politics because they see it as a route for loud careerists who worry about the wrong issues - like student parking! "
    },
    {
        "id": 0.0224227773651,
        "content": "Maith sibh ar fad. Moltaí iontacha! Tá mé féin iontach bródúil as an fhorbairt atá tagtha ar Ghaeilge in DCU le cúpla bliain anuas agus maith a leithéid de @Siobhan_Seoighe as an obair dhícheallach sin. Leis an oiread suime sa Ghaeilge ba chóir cinnte coiste a  bhunú. Tá grúpa daoine de dhith anois chun fuinneamh agus gníomh a chur leis na smaointí. Ba chóir go mbeadh meascán de mhic léinn agus foireann ar an choiste agus seans fosta gur chóir cuireadh a thabhairt do iar-mhic léinn ó am go ham fosta. Sílim go mbeadh an inchur sin tábhachtach ....Agus ní amháin mar gur mhaith liomsa filleadh ar DCU!! "
    },
    {
        "id": 0.0124316508532,
        "content": "Jack,I think that is a really interesting point. DCU currently supports our Public Dialogue Programme (see http://nordubco.ie/?page_id=20 for some details of the most recent conference on Mayoral Governance in Dublin) but a challenge that we are increasingly faced with is the dissemination of what we consider critical contributions. As you said many of the traditional journal outlets are prohibitively expensive and there are access issues for citizens and communities and more recently many international publishers have altered the business model to make access to their publications even more expensive. As a public university there is a duty incumbent upon us to disseminate our contributions but we are facing considerable obstacles and in some ways it is becoming more difficult rather than easier.Deiric "
    },
    {
        "id": 0.0124316508532,
        "content": "Rith rud inteacht liom díreach ansin, de réir mar a thuigim tá \"lárionad Gaeilge\" le bunú i mBaile Átha Cliath sna blianta atá amach romhainn. Siocair an áit a bhfuil DCU suite, cad chuige nach dtiocfadh le DCU bheith mar sórt \"lárionad Gaeilge\" - áit a dtiocfadh le daoine theacht le chéile le gníomhadh ar son na Gaeilge nó imeachtaí Gaeilge a chur ar siúl nó cibé. Nó fiú go mbeadh fhios ag daoine go bhfuil an Ghaeilge lárnach ar na campais uilig agus go bhfuil deiseanna labhartha ar fáil do achan duine "
    },
    {
        "id": 0.00857748541371,
        "content": "Pé teanga a úsáideann tú nuair a bhuaileann tú le duine is minic a leanann sin mar theanga an chaidrimh. Ó mo thaithí le Na Gaeil Óga CLG agus na cumainn Gaelacha eile braithim go bhfuil sé ríthábhachtach mar sin deiseanna a chruthú a spreagann daoine le Gaeilge a úsáid. "
    },
    {
        "id": 0.00669285092428,
        "content": "Chabhraigh na modúil trí Ghaeilge agus an rang seo go mór liomsa go pearsanta. Níor fhreastail mé ar scoil lán Ghaelach, mar sin bhí mé sách lág ó thaobh teanga teicniciúla sna hábhair, i mata agus ceol mar shampla. Leis an gcúrsa seo so chéad bhliain bhí mé in ann mo stór focail Gaeilge a leathnú agus an Ghaeilge a úsáíd go neamhfhoirmiúil gach uile lá leis an rang tar éis agus roimh léachtaí. Ba ea é an deis is fearr i mo shaol chun Gaeilge a úsáid go laethúil agus anois táim ag iarraidh a bheith mar mhúnteoir i ngaelscoil mar gheall ar an taithí seo. Ba trua nach raibh na hacmhainní ann an bhliain dár gcionn nó nach raibh níos mó éileamh air sna blianta a tháinig tar éis muidne. Ach is iontach iad na cursaí atá fáil dúinn leis na hábhair mórspeisialachas sa Ghaeilge agus mionspeisialachas sa Ghaelscolaíocht. Bhain mé an-taitneamh astu. "
    },
    {
        "id": 0.00535156660523,
        "content": "The issue of 'double disadvantage'  has come up quite a bit in the National Policy group for Hear and Dare Schemes (the national schemes that facilitate access to HE for socially disadvantaged students, and students with disabilities). For those unfamiliar with the term 'Double disadvantage'  this means that an applicant has a disability and is also socially disadvantaged.  They have been identified as one of the priority groups for the Hear and Dare schemes. "
    }
]
